{
    "title": "Encounter #4 - Outpatient",
    "component": "SingleEncounterDocument",
    "props": {
        "encounter": {
            "encounter_no": 4,
            "meta": {
                "visit_type": "Outpatient",
                "date_time": "2024-06-03T11:30:55",
                "provider": {
                    "name": "Dr. P. Stevens",
                    "specialty": "Unknown"
                },
                "ui_risk_color": "yellow"
            },
            "assessment": {
                "impression": "Initiation of Methotrexate for Rheumatoid Arthritis management.",
                "differential": []
            },
            "chief_complaint": "Initiation of Disease-Modifying Anti-Rheumatic Drug (DMARD) - Methotrexate (MTX) for Rheumatoid Arthritis (RA) management.",
            "hpi": "Sarah Miller presents for the initiation of Methotrexate treatment for RA. She reports her joint pain has been stable but remains a significant source of discomfort, affecting her daily activities. A thorough review of her medical history, medication adherence, and lifestyle was conducted. The patient confirms receipt and comprehension of the Methotrexate informational leaflet, indicating understanding of the treatment regimen and potential adverse effects. The decision to commence Methotrexate was made following normalization of liver function tests (LFTs) as of May 6, 2024. The patient reiterated understanding of the importance of strict compliance with the monitoring schedule due to the severe hepatotoxicity risk associated with Methotrexate.",
            "medications_prior": [],
            "physical_exam": {
                "general": "Vital Signs: BP 138/86 mmHg (sitting), HR 80 bpm, RR 15/min, Temp 36.7°C, SpO₂ 98% on room air. Anthropometrics: Weight 84 kg (BMI 31.2 kg/m²). Weight stable compared with early May.",
                "msk": "",
                "other_systems": ""
            },
            "plan": {
                "investigations": {
                    "imaging": [],
                    "labs": [
                        "LFTs every six weeks",
                        "Full Blood Count (FBC) every six weeks"
                    ]
                },
                "management": {
                    "follow_up": "First LFT/FBC evaluation scheduled for July 15, 2024. Regular monitoring every six weeks for the next 6 months. Patient to contact clinic immediately if severe nausea, vomiting, or jaundice occur.",
                    "medications_started": [
                        {
                            "dose": "7.5mg",
                            "frequency": "once weekly",
                            "name": "Methotrexate",
                            "route": "orally"
                        },
                        {
                            "dose": "5mg",
                            "frequency": "weekly",
                            "name": "Folic Acid",
                            "route": "orally"
                        }
                    ]
                }
            },
            "reason_for_visit": "Initiation of Methotrexate for Rheumatoid Arthritis management."
        },
        "patient": {
            "name": "Sarah Miller",
            "sex": "Female",
            "age_at_first_encounter": 43
        },
        "encounterIndex": 4,
        "dataSource": "Medilogik"
    }
}