{
    "title": "Encounter #7 - Inpatient Hepatology Ward B",
    "component": "SingleEncounterDocument",
    "props": {
        "encounter": {
            "encounter_no": 7,
            "meta": {
                "visit_type": "Inpatient",
                "date_time": "2024-08-15T10:00:48",
                "provider": {
                    "name": "Dr. R. Sharma",
                    "specialty": "Consultant Hepatologist"
                },
                "ui_risk_color": "yellow"
            },
            "assessment": {
                "impression": "Severe Drug-Induced Liver Injury (DILI) secondary to Methotrexate, with a RUCAM score of 9/10, indicating a high likelihood of causation. No features of Acute-on-Chronic Liver Failure (ACLF). Underlying Metabolic Associated Steatotic Hepatitis (MASH).",
                "differential": []
            },
            "chief_complaint": "Severe Drug-Induced Liver Injury (DILI)",
            "hpi": "The patient is reviewed on Day 3 of her hospital admission following severe DILI. Methotrexate was stopped immediately upon recognizing it as the causative agent. Sarah remains significantly jaundiced; however, nausea has shown slight improvement since admission. Vital neurological signs include a stable Glasgow Coma Scale (GCS) score of 15, with no evidence of hepatic encephalopathy (HE); absence of asterixis or cognitive impairment. The ALT level, though elevated at 420 U/L, is beginning to decline, suggesting a positive response to the cessation of Methotrexate. Crucially, the INR remains stable at 1.1, indicating preserved liver synthetic function. These clinical findings collectively confirm a diagnosis of severe, cholestatic DILI in a patient with underlying Metabolic Associated Steatotic Hepatitis (MASH), markedly susceptible to hepatotoxic insults.",
            "medications_prior": [],
            "physical_exam": {
                "general": "Sarah exhibits pronounced jaundice, evidenced by a total bilirubin level of 190 μmol/L. Despite this, she appears alert and reports moderate comfort under current care measures. Vital Signs (ward review): BP 128/82 mmHg, HR 96 bpm, RR 16/min, Temp 37.0°C, SpO₂ 97% on room air. Anthropometrics: Weight 81 kg (BMI 30.1 kg/m²). No significant interval weight change since admission.",
                "msk": "",
                "other_systems": "CNS Examination: She is fully oriented, demonstrating no neurological deficits. GCS remains a reassuring 15 with negative neurological signs including asterixis, tremor, and speech abnormalities. Cardio/Pulmonary: Vital signs are stable with no indications of fluid overload, pulmonary distress, or hepatorenal syndrome. Abdominal Examination: The abdomen is soft and non-tender. The liver edge is not easily palpable due to Sarah's body habitus, yet no tenderness is detected upon examination."
            },
            "plan": {
                "investigations": {
                    "imaging": [
                        "Fibroscan in three months"
                    ],
                    "labs": [
                        "Daily INR evaluations until ALT levels fall below 150 U/L",
                        "Neurological assessments every four hours"
                    ]
                },
                "management": {
                    "follow_up": "Arrange a Fibroscan (Liver Stiffness Measurement) in three months to assess fibrosis arising from chronic MASH and the acute DILI event. Coordinate with Rheumatology for the initiation of a non-hepatotoxic DMARD alternative, such as Hydroxychloroquine or a biologic, to manage RA without compromising liver health.",
                    "medications_started": [
                        {
                            "dose": "500mg",
                            "frequency": "twice daily",
                            "name": "Ursodeoxycholic Acid (UDCA)",
                            "route": ""
                        },
                        {
                            "dose": "",
                            "frequency": "",
                            "name": "Folic Acid",
                            "route": ""
                        }
                    ]
                }
            },
            "reason_for_visit": "Review on Day 3 of hospital admission following severe DILI."
        },
        "patient": {
            "name": "Sarah Miller",
            "sex": "Female",
            "age_at_first_encounter": 43
        },
        "encounterIndex": 7,
        "dataSource": "Nervecentre"
    }
}